import { Component, OnInit } from '@angular/core';
import * as d3 from 'd3';
import * as ChartJS from 'chart.js';
import * as pluginAnnotation from 'chartjs-plugin-annotation';




interface CountyDayData {
  date:string|Date;
  value:number;
};

interface CountyDayDataParsed {
  value:number;
};

interface CountyData {
  County:string;
  Cases:CountyDayData[];
  color?:string;
};

@Component({
  selector: 'app-county-graphs',
  templateUrl: './county-graphs.component.html',
  styleUrls: ['./county-graphs.component.css']
})

export class CountyGraphsComponent implements OnInit {  

  county_data:CountyData[] =[{"County":"Alba","Cases":[{"date":"2020-03-18","value":1},{"date":"2020-03-19","value":1},{"date":"2020-03-20","value":1},{"date":"2020-03-21","value":1},{"date":"2020-04-01","value":7},{"date":"2020-04-02","value":9},{"date":"2020-04-03","value":13},{"date":"2020-04-04","value":15},{"date":"2020-04-05","value":33},{"date":"2020-04-06","value":34},{"date":"2020-04-07","value":50},{"date":"2020-04-08","value":83},{"date":"2020-04-09","value":90},{"date":"2020-04-10","value":100},{"date":"2020-04-11","value":103},{"date":"2020-04-12","value":108},{"date":"2020-04-13","value":109},{"date":"2020-04-14","value":118},{"date":"2020-04-15","value":133},{"date":"2020-04-16","value":141}]},{"County":"Arad","Cases":[{"date":"2020-03-15","value":4},{"date":"2020-03-16","value":8},{"date":"2020-03-17","value":8},{"date":"2020-03-18","value":8},{"date":"2020-03-19","value":8},{"date":"2020-03-20","value":8},{"date":"2020-03-21","value":8},{"date":"2020-04-01","value":110},{"date":"2020-04-02","value":110},{"date":"2020-04-03","value":110},{"date":"2020-04-04","value":128},{"date":"2020-04-05","value":150},{"date":"2020-04-06","value":157},{"date":"2020-04-07","value":161},{"date":"2020-04-08","value":161},{"date":"2020-04-09","value":162},{"date":"2020-04-10","value":179},{"date":"2020-04-11","value":229},{"date":"2020-04-12","value":249},{"date":"2020-04-13","value":270},{"date":"2020-04-14","value":280},{"date":"2020-04-15","value":312},{"date":"2020-04-16","value":339}]},{"County":"Argeș","Cases":[{"date":"2020-03-20","value":1},{"date":"2020-03-21","value":1},{"date":"2020-04-01","value":9},{"date":"2020-04-02","value":10},{"date":"2020-04-03","value":12},{"date":"2020-04-04","value":14},{"date":"2020-04-05","value":25},{"date":"2020-04-06","value":27},{"date":"2020-04-07","value":31},{"date":"2020-04-08","value":33},{"date":"2020-04-09","value":32},{"date":"2020-04-10","value":52},{"date":"2020-04-11","value":51},{"date":"2020-04-12","value":57},{"date":"2020-04-13","value":57},{"date":"2020-04-14","value":59},{"date":"2020-04-15","value":62},{"date":"2020-04-16","value":67}]},{"County":"Bacău","Cases":[{"date":"2020-03-13","value":1},{"date":"2020-03-14","value":1},{"date":"2020-03-15","value":1},{"date":"2020-03-16","value":1},{"date":"2020-03-17","value":1},{"date":"2020-03-18","value":1},{"date":"2020-03-19","value":1},{"date":"2020-03-20","value":2},{"date":"2020-03-21","value":2},{"date":"2020-04-01","value":19},{"date":"2020-04-02","value":19},{"date":"2020-04-03","value":24},{"date":"2020-04-04","value":27},{"date":"2020-04-05","value":38},{"date":"2020-04-06","value":39},{"date":"2020-04-07","value":47},{"date":"2020-04-08","value":51},{"date":"2020-04-09","value":56},{"date":"2020-04-10","value":58},{"date":"2020-04-11","value":65},{"date":"2020-04-12","value":69},{"date":"2020-04-13","value":76},{"date":"2020-04-14","value":76},{"date":"2020-04-15","value":81},{"date":"2020-04-16","value":94}]},{"County":"Bihor","Cases":[{"date":"2020-03-13","value":1},{"date":"2020-03-14","value":1},{"date":"2020-03-15","value":1},{"date":"2020-03-16","value":1},{"date":"2020-03-17","value":1},{"date":"2020-03-18","value":2},{"date":"2020-03-19","value":2},{"date":"2020-03-20","value":3},{"date":"2020-03-21","value":5},{"date":"2020-04-01","value":32},{"date":"2020-04-02","value":39},{"date":"2020-04-03","value":44},{"date":"2020-04-04","value":46},{"date":"2020-04-05","value":46},{"date":"2020-04-06","value":52},{"date":"2020-04-07","value":55},{"date":"2020-04-08","value":58},{"date":"2020-04-09","value":66},{"date":"2020-04-10","value":70},{"date":"2020-04-11","value":83},{"date":"2020-04-12","value":83},{"date":"2020-04-13","value":176},{"date":"2020-04-14","value":190},{"date":"2020-04-15","value":198},{"date":"2020-04-16","value":219}]},{"County":"Bistrița-Năsăud","Cases":[{"date":"2020-03-17","value":1},{"date":"2020-03-18","value":1},{"date":"2020-03-19","value":3},{"date":"2020-03-20","value":3},{"date":"2020-03-21","value":4},{"date":"2020-04-01","value":22},{"date":"2020-04-02","value":22},{"date":"2020-04-03","value":27},{"date":"2020-04-04","value":28},{"date":"2020-04-05","value":42},{"date":"2020-04-06","value":58},{"date":"2020-04-07","value":70},{"date":"2020-04-08","value":72},{"date":"2020-04-09","value":76},{"date":"2020-04-10","value":78},{"date":"2020-04-11","value":82},{"date":"2020-04-12","value":82},{"date":"2020-04-13","value":82},{"date":"2020-04-14","value":89},{"date":"2020-04-15","value":93},{"date":"2020-04-16","value":93}]},{"County":"Botoșani","Cases":[{"date":"2020-03-17","value":1},{"date":"2020-03-18","value":1},{"date":"2020-03-19","value":1},{"date":"2020-03-20","value":1},{"date":"2020-03-21","value":1},{"date":"2020-04-01","value":40},{"date":"2020-04-02","value":40},{"date":"2020-04-03","value":44},{"date":"2020-04-04","value":48},{"date":"2020-04-05","value":68},{"date":"2020-04-06","value":84},{"date":"2020-04-07","value":86},{"date":"2020-04-08","value":89},{"date":"2020-04-09","value":106},{"date":"2020-04-10","value":119},{"date":"2020-04-11","value":155},{"date":"2020-04-12","value":156},{"date":"2020-04-13","value":156},{"date":"2020-04-14","value":172},{"date":"2020-04-15","value":231},{"date":"2020-04-16","value":290}]},{"County":"Brașov","Cases":[{"date":"2020-03-13","value":2},{"date":"2020-03-14","value":4},{"date":"2020-03-15","value":7},{"date":"2020-03-16","value":7},{"date":"2020-03-17","value":12},{"date":"2020-03-18","value":15},{"date":"2020-03-19","value":15},{"date":"2020-03-20","value":16},{"date":"2020-03-21","value":25},{"date":"2020-04-01","value":105},{"date":"2020-04-02","value":117},{"date":"2020-04-03","value":124},{"date":"2020-04-04","value":127},{"date":"2020-04-05","value":131},{"date":"2020-04-06","value":138},{"date":"2020-04-07","value":156},{"date":"2020-04-08","value":161},{"date":"2020-04-09","value":175},{"date":"2020-04-10","value":190},{"date":"2020-04-11","value":219},{"date":"2020-04-12","value":238},{"date":"2020-04-13","value":253},{"date":"2020-04-14","value":263},{"date":"2020-04-15","value":270},{"date":"2020-04-16","value":286}]},{"County":"Brăila","Cases":[{"date":"2020-03-15","value":2},{"date":"2020-03-16","value":2},{"date":"2020-03-17","value":2},{"date":"2020-03-18","value":2},{"date":"2020-03-19","value":2},{"date":"2020-03-20","value":2},{"date":"2020-03-21","value":2},{"date":"2020-04-01","value":10},{"date":"2020-04-02","value":11},{"date":"2020-04-03","value":13},{"date":"2020-04-04","value":11},{"date":"2020-04-05","value":11},{"date":"2020-04-06","value":11},{"date":"2020-04-07","value":12},{"date":"2020-04-08","value":14},{"date":"2020-04-09","value":16},{"date":"2020-04-10","value":16},{"date":"2020-04-11","value":16},{"date":"2020-04-12","value":16},{"date":"2020-04-13","value":16},{"date":"2020-04-14","value":16},{"date":"2020-04-15","value":16},{"date":"2020-04-16","value":16}]},{"County":"Buzău","Cases":[{"date":"2020-03-09","value":1},{"date":"2020-03-10","value":1},{"date":"2020-03-11","value":1},{"date":"2020-03-12","value":1},{"date":"2020-03-13","value":1},{"date":"2020-03-14","value":1},{"date":"2020-03-15","value":1},{"date":"2020-03-16","value":2},{"date":"2020-03-17","value":2},{"date":"2020-03-18","value":2},{"date":"2020-03-19","value":2},{"date":"2020-03-20","value":2},{"date":"2020-03-21","value":2},{"date":"2020-04-01","value":11},{"date":"2020-04-02","value":12},{"date":"2020-04-03","value":12},{"date":"2020-04-04","value":12},{"date":"2020-04-05","value":12},{"date":"2020-04-06","value":13},{"date":"2020-04-07","value":13},{"date":"2020-04-08","value":13},{"date":"2020-04-09","value":13},{"date":"2020-04-10","value":13},{"date":"2020-04-11","value":13},{"date":"2020-04-12","value":13},{"date":"2020-04-13","value":13},{"date":"2020-04-14","value":14},{"date":"2020-04-15","value":14},{"date":"2020-04-16","value":14}]},{"County":"Caraș-Severin","Cases":[{"date":"2020-03-10","value":1},{"date":"2020-03-11","value":1},{"date":"2020-03-12","value":1},{"date":"2020-03-13","value":4},{"date":"2020-03-14","value":5},{"date":"2020-03-15","value":5},{"date":"2020-03-16","value":5},{"date":"2020-03-17","value":5},{"date":"2020-03-18","value":5},{"date":"2020-03-19","value":5},{"date":"2020-03-20","value":5},{"date":"2020-03-21","value":5},{"date":"2020-04-01","value":13},{"date":"2020-04-02","value":13},{"date":"2020-04-03","value":17},{"date":"2020-04-04","value":17},{"date":"2020-04-05","value":21},{"date":"2020-04-06","value":21},{"date":"2020-04-07","value":23},{"date":"2020-04-08","value":28},{"date":"2020-04-09","value":34},{"date":"2020-04-10","value":38},{"date":"2020-04-11","value":48},{"date":"2020-04-12","value":51},{"date":"2020-04-13","value":53},{"date":"2020-04-14","value":57},{"date":"2020-04-15","value":57},{"date":"2020-04-16","value":58}]},{"County":"Călărași","Cases":[{"date":"2020-03-20","value":1},{"date":"2020-03-21","value":1},{"date":"2020-04-01","value":17},{"date":"2020-04-02","value":17},{"date":"2020-04-03","value":26},{"date":"2020-04-04","value":29},{"date":"2020-04-05","value":30},{"date":"2020-04-06","value":31},{"date":"2020-04-07","value":33},{"date":"2020-04-08","value":35},{"date":"2020-04-09","value":34},{"date":"2020-04-10","value":35},{"date":"2020-04-11","value":35},{"date":"2020-04-12","value":35},{"date":"2020-04-13","value":39},{"date":"2020-04-14","value":39},{"date":"2020-04-15","value":41},{"date":"2020-04-16","value":41}]},{"County":"Cluj","Cases":[{"date":"2020-03-12","value":2},{"date":"2020-03-13","value":2},{"date":"2020-03-14","value":3},{"date":"2020-03-15","value":3},{"date":"2020-03-16","value":4},{"date":"2020-03-17","value":4},{"date":"2020-03-18","value":4},{"date":"2020-03-19","value":6},{"date":"2020-03-20","value":16},{"date":"2020-03-21","value":18},{"date":"2020-04-01","value":90},{"date":"2020-04-02","value":105},{"date":"2020-04-03","value":108},{"date":"2020-04-04","value":121},{"date":"2020-04-05","value":110},{"date":"2020-04-06","value":114},{"date":"2020-04-07","value":119},{"date":"2020-04-08","value":129},{"date":"2020-04-09","value":148},{"date":"2020-04-10","value":152},{"date":"2020-04-11","value":177},{"date":"2020-04-12","value":183},{"date":"2020-04-13","value":187},{"date":"2020-04-14","value":198},{"date":"2020-04-15","value":203},{"date":"2020-04-16","value":215}]},{"County":"Constanța","Cases":[{"date":"2020-03-11","value":1},{"date":"2020-03-12","value":1},{"date":"2020-03-13","value":5},{"date":"2020-03-14","value":9},{"date":"2020-03-15","value":10},{"date":"2020-03-16","value":11},{"date":"2020-03-17","value":12},{"date":"2020-03-18","value":14},{"date":"2020-03-19","value":15},{"date":"2020-03-20","value":21},{"date":"2020-03-21","value":25},{"date":"2020-04-01","value":111},{"date":"2020-04-02","value":111},{"date":"2020-04-03","value":117},{"date":"2020-04-04","value":110},{"date":"2020-04-05","value":114},{"date":"2020-04-06","value":117},{"date":"2020-04-07","value":119},{"date":"2020-04-08","value":114},{"date":"2020-04-09","value":124},{"date":"2020-04-10","value":124},{"date":"2020-04-11","value":155},{"date":"2020-04-12","value":157},{"date":"2020-04-13","value":151},{"date":"2020-04-14","value":158},{"date":"2020-04-15","value":163},{"date":"2020-04-16","value":168}]},{"County":"Covasna","Cases":[{"date":"2020-03-11","value":1},{"date":"2020-03-12","value":2},{"date":"2020-03-13","value":4},{"date":"2020-03-14","value":4},{"date":"2020-03-15","value":4},{"date":"2020-03-16","value":4},{"date":"2020-03-17","value":4},{"date":"2020-03-18","value":4},{"date":"2020-03-19","value":6},{"date":"2020-03-20","value":6},{"date":"2020-03-21","value":7},{"date":"2020-04-01","value":28},{"date":"2020-04-02","value":34},{"date":"2020-04-03","value":38},{"date":"2020-04-04","value":37},{"date":"2020-04-05","value":47},{"date":"2020-04-06","value":52},{"date":"2020-04-07","value":55},{"date":"2020-04-08","value":57},{"date":"2020-04-09","value":62},{"date":"2020-04-10","value":79},{"date":"2020-04-11","value":91},{"date":"2020-04-12","value":117},{"date":"2020-04-13","value":123},{"date":"2020-04-14","value":124},{"date":"2020-04-15","value":123},{"date":"2020-04-16","value":123}]},{"County":"Dâmbovița","Cases":[{"date":"2020-04-01","value":17},{"date":"2020-04-02","value":19},{"date":"2020-04-03","value":19},{"date":"2020-04-04","value":27},{"date":"2020-04-05","value":23},{"date":"2020-04-06","value":24},{"date":"2020-04-07","value":25},{"date":"2020-04-08","value":27},{"date":"2020-04-09","value":28},{"date":"2020-04-10","value":30},{"date":"2020-04-11","value":30},{"date":"2020-04-12","value":30},{"date":"2020-04-13","value":31},{"date":"2020-04-14","value":31},{"date":"2020-04-15","value":31},{"date":"2020-04-16","value":31}]},{"County":"Dolj","Cases":[{"date":"2020-03-11","value":2},{"date":"2020-03-12","value":2},{"date":"2020-03-13","value":2},{"date":"2020-03-14","value":3},{"date":"2020-03-15","value":3},{"date":"2020-03-16","value":3},{"date":"2020-03-17","value":3},{"date":"2020-03-18","value":4},{"date":"2020-03-19","value":5},{"date":"2020-03-20","value":5},{"date":"2020-03-21","value":5},{"date":"2020-04-01","value":19},{"date":"2020-04-02","value":22},{"date":"2020-04-03","value":27},{"date":"2020-04-04","value":27},{"date":"2020-04-05","value":27},{"date":"2020-04-06","value":29},{"date":"2020-04-07","value":29},{"date":"2020-04-08","value":39},{"date":"2020-04-09","value":39},{"date":"2020-04-10","value":40},{"date":"2020-04-11","value":43},{"date":"2020-04-12","value":43},{"date":"2020-04-13","value":44},{"date":"2020-04-14","value":43},{"date":"2020-04-15","value":55},{"date":"2020-04-16","value":55}]},{"County":"Galați","Cases":[{"date":"2020-03-07","value":1},{"date":"2020-03-08","value":1},{"date":"2020-03-09","value":1},{"date":"2020-03-10","value":1},{"date":"2020-03-11","value":1},{"date":"2020-03-12","value":1},{"date":"2020-03-13","value":1},{"date":"2020-03-14","value":1},{"date":"2020-03-15","value":1},{"date":"2020-03-16","value":2},{"date":"2020-03-17","value":2},{"date":"2020-03-18","value":2},{"date":"2020-03-19","value":2},{"date":"2020-03-20","value":2},{"date":"2020-03-21","value":2},{"date":"2020-04-01","value":79},{"date":"2020-04-02","value":82},{"date":"2020-04-03","value":90},{"date":"2020-04-04","value":101},{"date":"2020-04-05","value":101},{"date":"2020-04-06","value":119},{"date":"2020-04-07","value":133},{"date":"2020-04-08","value":128},{"date":"2020-04-09","value":175},{"date":"2020-04-10","value":182},{"date":"2020-04-11","value":183},{"date":"2020-04-12","value":190},{"date":"2020-04-13","value":195},{"date":"2020-04-14","value":204},{"date":"2020-04-15","value":229},{"date":"2020-04-16","value":240}]},{"County":"Giurgiu","Cases":[{"date":"2020-03-21","value":2},{"date":"2020-04-01","value":19},{"date":"2020-04-02","value":19},{"date":"2020-04-03","value":22},{"date":"2020-04-04","value":23},{"date":"2020-04-05","value":24},{"date":"2020-04-06","value":32},{"date":"2020-04-07","value":34},{"date":"2020-04-08","value":36},{"date":"2020-04-09","value":46},{"date":"2020-04-10","value":46},{"date":"2020-04-11","value":47},{"date":"2020-04-12","value":49},{"date":"2020-04-13","value":64},{"date":"2020-04-14","value":74},{"date":"2020-04-15","value":75},{"date":"2020-04-16","value":80}]},{"County":"Gorj","Cases":[{"date":"2020-02-26","value":1},{"date":"2020-02-27","value":1},{"date":"2020-02-28","value":1},{"date":"2020-02-29","value":1},{"date":"2020-03-01","value":1},{"date":"2020-03-02","value":1},{"date":"2020-03-03","value":1},{"date":"2020-03-04","value":1},{"date":"2020-03-05","value":1},{"date":"2020-03-06","value":1},{"date":"2020-03-07","value":1},{"date":"2020-03-08","value":1},{"date":"2020-03-09","value":1},{"date":"2020-03-10","value":1},{"date":"2020-03-11","value":2},{"date":"2020-03-12","value":2},{"date":"2020-03-13","value":2},{"date":"2020-03-14","value":2},{"date":"2020-03-15","value":2},{"date":"2020-03-16","value":2},{"date":"2020-03-17","value":2},{"date":"2020-03-18","value":2},{"date":"2020-03-19","value":2},{"date":"2020-03-20","value":4},{"date":"2020-03-21","value":4},{"date":"2020-04-01","value":7},{"date":"2020-04-02","value":7},{"date":"2020-04-03","value":8},{"date":"2020-04-04","value":8},{"date":"2020-04-05","value":8},{"date":"2020-04-06","value":8},{"date":"2020-04-07","value":7},{"date":"2020-04-08","value":7},{"date":"2020-04-09","value":9},{"date":"2020-04-10","value":10},{"date":"2020-04-11","value":8},{"date":"2020-04-12","value":8},{"date":"2020-04-13","value":10},{"date":"2020-04-14","value":10},{"date":"2020-04-15","value":10},{"date":"2020-04-16","value":10}]},{"County":"Harghita","Cases":[{"date":"2020-04-03","value":1},{"date":"2020-04-04","value":1},{"date":"2020-04-05","value":1},{"date":"2020-04-06","value":3},{"date":"2020-04-07","value":3},{"date":"2020-04-08","value":3},{"date":"2020-04-09","value":4},{"date":"2020-04-10","value":5},{"date":"2020-04-11","value":6},{"date":"2020-04-12","value":7},{"date":"2020-04-13","value":7},{"date":"2020-04-14","value":7},{"date":"2020-04-15","value":7},{"date":"2020-04-16","value":9}]},{"County":"Hunedoara","Cases":[{"date":"2020-03-06","value":1},{"date":"2020-03-07","value":2},{"date":"2020-03-08","value":2},{"date":"2020-03-09","value":2},{"date":"2020-03-10","value":4},{"date":"2020-03-11","value":4},{"date":"2020-03-12","value":10},{"date":"2020-03-13","value":10},{"date":"2020-03-14","value":20},{"date":"2020-03-15","value":20},{"date":"2020-03-16","value":21},{"date":"2020-03-17","value":21},{"date":"2020-03-18","value":23},{"date":"2020-03-19","value":23},{"date":"2020-03-20","value":23},{"date":"2020-03-21","value":23},{"date":"2020-04-01","value":75},{"date":"2020-04-02","value":100},{"date":"2020-04-03","value":108},{"date":"2020-04-04","value":123},{"date":"2020-04-05","value":124},{"date":"2020-04-06","value":138},{"date":"2020-04-07","value":158},{"date":"2020-04-08","value":174},{"date":"2020-04-09","value":212},{"date":"2020-04-10","value":227},{"date":"2020-04-11","value":254},{"date":"2020-04-12","value":303},{"date":"2020-04-13","value":303},{"date":"2020-04-14","value":320},{"date":"2020-04-15","value":320},{"date":"2020-04-16","value":333}]},{"County":"Ialomița","Cases":[{"date":"2020-03-16","value":1},{"date":"2020-03-17","value":2},{"date":"2020-03-18","value":2},{"date":"2020-03-19","value":2},{"date":"2020-03-20","value":3},{"date":"2020-03-21","value":3},{"date":"2020-04-01","value":29},{"date":"2020-04-02","value":37},{"date":"2020-04-03","value":45},{"date":"2020-04-04","value":50},{"date":"2020-04-05","value":56},{"date":"2020-04-06","value":63},{"date":"2020-04-07","value":72},{"date":"2020-04-08","value":79},{"date":"2020-04-09","value":81},{"date":"2020-04-10","value":85},{"date":"2020-04-11","value":89},{"date":"2020-04-12","value":100},{"date":"2020-04-13","value":102},{"date":"2020-04-14","value":108},{"date":"2020-04-15","value":110},{"date":"2020-04-16","value":114}]},{"County":"Iași","Cases":[{"date":"2020-03-11","value":3},{"date":"2020-03-12","value":3},{"date":"2020-03-13","value":5},{"date":"2020-03-14","value":5},{"date":"2020-03-15","value":6},{"date":"2020-03-16","value":6},{"date":"2020-03-17","value":13},{"date":"2020-03-18","value":20},{"date":"2020-03-19","value":21},{"date":"2020-03-20","value":21},{"date":"2020-03-21","value":24},{"date":"2020-04-01","value":52},{"date":"2020-04-02","value":54},{"date":"2020-04-03","value":72},{"date":"2020-04-04","value":81},{"date":"2020-04-05","value":88},{"date":"2020-04-06","value":87},{"date":"2020-04-07","value":92},{"date":"2020-04-08","value":106},{"date":"2020-04-09","value":131},{"date":"2020-04-10","value":99},{"date":"2020-04-11","value":107},{"date":"2020-04-12","value":113},{"date":"2020-04-13","value":118},{"date":"2020-04-14","value":119},{"date":"2020-04-15","value":121},{"date":"2020-04-16","value":130}]},{"County":"Ilfov","Cases":[{"date":"2020-03-16","value":5},{"date":"2020-03-17","value":5},{"date":"2020-03-18","value":8},{"date":"2020-03-19","value":9},{"date":"2020-03-20","value":9},{"date":"2020-03-21","value":9},{"date":"2020-04-01","value":47},{"date":"2020-04-02","value":54},{"date":"2020-04-03","value":60},{"date":"2020-04-04","value":64},{"date":"2020-04-05","value":78},{"date":"2020-04-06","value":89},{"date":"2020-04-07","value":99},{"date":"2020-04-08","value":99},{"date":"2020-04-09","value":107},{"date":"2020-04-10","value":115},{"date":"2020-04-11","value":117},{"date":"2020-04-12","value":119},{"date":"2020-04-13","value":126},{"date":"2020-04-14","value":132},{"date":"2020-04-15","value":135},{"date":"2020-04-16","value":154}]},{"County":"Maramureș","Cases":[{"date":"2020-02-28","value":1},{"date":"2020-02-29","value":1},{"date":"2020-03-01","value":1},{"date":"2020-03-02","value":1},{"date":"2020-03-03","value":1},{"date":"2020-03-04","value":1},{"date":"2020-03-05","value":1},{"date":"2020-03-06","value":1},{"date":"2020-03-07","value":1},{"date":"2020-03-08","value":1},{"date":"2020-03-09","value":1},{"date":"2020-03-10","value":1},{"date":"2020-03-11","value":1},{"date":"2020-03-12","value":1},{"date":"2020-03-13","value":1},{"date":"2020-03-14","value":1},{"date":"2020-03-15","value":1},{"date":"2020-03-16","value":1},{"date":"2020-03-17","value":1},{"date":"2020-03-18","value":3},{"date":"2020-03-19","value":3},{"date":"2020-03-20","value":3},{"date":"2020-03-21","value":4},{"date":"2020-04-01","value":39},{"date":"2020-04-02","value":39},{"date":"2020-04-03","value":46},{"date":"2020-04-04","value":42},{"date":"2020-04-05","value":42},{"date":"2020-04-06","value":42},{"date":"2020-04-07","value":43},{"date":"2020-04-08","value":41},{"date":"2020-04-09","value":43},{"date":"2020-04-10","value":43},{"date":"2020-04-11","value":45},{"date":"2020-04-12","value":49},{"date":"2020-04-13","value":49},{"date":"2020-04-14","value":51},{"date":"2020-04-15","value":55},{"date":"2020-04-16","value":55}]},{"County":"Mehedinți","Cases":[{"date":"2020-03-13","value":2},{"date":"2020-03-14","value":2},{"date":"2020-03-15","value":2},{"date":"2020-03-16","value":2},{"date":"2020-03-17","value":2},{"date":"2020-03-18","value":2},{"date":"2020-03-19","value":2},{"date":"2020-03-20","value":2},{"date":"2020-03-21","value":2},{"date":"2020-04-01","value":9},{"date":"2020-04-02","value":10},{"date":"2020-04-03","value":11},{"date":"2020-04-04","value":13},{"date":"2020-04-05","value":12},{"date":"2020-04-06","value":13},{"date":"2020-04-07","value":13},{"date":"2020-04-08","value":13},{"date":"2020-04-09","value":15},{"date":"2020-04-10","value":16},{"date":"2020-04-11","value":17},{"date":"2020-04-12","value":17},{"date":"2020-04-13","value":19},{"date":"2020-04-14","value":22},{"date":"2020-04-15","value":22},{"date":"2020-04-16","value":28}]},{"County":"Mureș","Cases":[{"date":"2020-03-08","value":1},{"date":"2020-03-09","value":1},{"date":"2020-03-10","value":1},{"date":"2020-03-11","value":1},{"date":"2020-03-12","value":2},{"date":"2020-03-13","value":2},{"date":"2020-03-14","value":2},{"date":"2020-03-15","value":2},{"date":"2020-03-16","value":3},{"date":"2020-03-17","value":4},{"date":"2020-03-18","value":4},{"date":"2020-03-19","value":4},{"date":"2020-03-20","value":6},{"date":"2020-03-21","value":6},{"date":"2020-04-01","value":38},{"date":"2020-04-02","value":38},{"date":"2020-04-03","value":55},{"date":"2020-04-04","value":57},{"date":"2020-04-05","value":57},{"date":"2020-04-06","value":56},{"date":"2020-04-07","value":92},{"date":"2020-04-08","value":103},{"date":"2020-04-09","value":146},{"date":"2020-04-10","value":161},{"date":"2020-04-11","value":203},{"date":"2020-04-12","value":217},{"date":"2020-04-13","value":222},{"date":"2020-04-14","value":229},{"date":"2020-04-15","value":243},{"date":"2020-04-16","value":250}]},{"County":"Neamț","Cases":[{"date":"2020-03-12","value":1},{"date":"2020-03-13","value":2},{"date":"2020-03-14","value":2},{"date":"2020-03-15","value":2},{"date":"2020-03-16","value":3},{"date":"2020-03-17","value":5},{"date":"2020-03-18","value":5},{"date":"2020-03-19","value":5},{"date":"2020-03-20","value":6},{"date":"2020-03-21","value":14},{"date":"2020-04-01","value":94},{"date":"2020-04-02","value":107},{"date":"2020-04-03","value":150},{"date":"2020-04-04","value":148},{"date":"2020-04-05","value":160},{"date":"2020-04-06","value":160},{"date":"2020-04-07","value":182},{"date":"2020-04-08","value":196},{"date":"2020-04-09","value":202},{"date":"2020-04-10","value":234},{"date":"2020-04-11","value":265},{"date":"2020-04-12","value":285},{"date":"2020-04-13","value":286},{"date":"2020-04-14","value":304},{"date":"2020-04-15","value":344},{"date":"2020-04-16","value":348}]},{"County":"Olt","Cases":[{"date":"2020-03-06","value":1},{"date":"2020-03-07","value":1},{"date":"2020-03-08","value":1},{"date":"2020-03-09","value":1},{"date":"2020-03-10","value":1},{"date":"2020-03-11","value":2},{"date":"2020-03-12","value":2},{"date":"2020-03-13","value":2},{"date":"2020-03-14","value":2},{"date":"2020-03-15","value":2},{"date":"2020-03-16","value":2},{"date":"2020-03-17","value":2},{"date":"2020-03-18","value":3},{"date":"2020-03-19","value":3},{"date":"2020-03-20","value":3},{"date":"2020-03-21","value":3},{"date":"2020-04-01","value":8},{"date":"2020-04-02","value":8},{"date":"2020-04-03","value":8},{"date":"2020-04-04","value":11},{"date":"2020-04-05","value":11},{"date":"2020-04-06","value":11},{"date":"2020-04-07","value":11},{"date":"2020-04-08","value":12},{"date":"2020-04-09","value":12},{"date":"2020-04-10","value":11},{"date":"2020-04-11","value":11},{"date":"2020-04-12","value":12},{"date":"2020-04-13","value":12},{"date":"2020-04-14","value":13},{"date":"2020-04-15","value":13},{"date":"2020-04-16","value":13}]},{"County":"Prahova","Cases":[{"date":"2020-03-13","value":1},{"date":"2020-03-14","value":1},{"date":"2020-03-15","value":1},{"date":"2020-03-16","value":1},{"date":"2020-03-17","value":2},{"date":"2020-03-18","value":2},{"date":"2020-03-19","value":2},{"date":"2020-03-20","value":2},{"date":"2020-03-21","value":6},{"date":"2020-04-01","value":26},{"date":"2020-04-02","value":27},{"date":"2020-04-03","value":27},{"date":"2020-04-04","value":25},{"date":"2020-04-05","value":26},{"date":"2020-04-06","value":33},{"date":"2020-04-07","value":36},{"date":"2020-04-08","value":36},{"date":"2020-04-09","value":36},{"date":"2020-04-10","value":38},{"date":"2020-04-11","value":39},{"date":"2020-04-12","value":39},{"date":"2020-04-13","value":39},{"date":"2020-04-14","value":39},{"date":"2020-04-15","value":39},{"date":"2020-04-16","value":48}]},{"County":"Satu Mare","Cases":[{"date":"2020-03-14","value":1},{"date":"2020-03-15","value":1},{"date":"2020-03-16","value":1},{"date":"2020-03-17","value":1},{"date":"2020-03-18","value":1},{"date":"2020-03-19","value":1},{"date":"2020-03-20","value":1},{"date":"2020-03-21","value":1},{"date":"2020-04-01","value":13},{"date":"2020-04-02","value":16},{"date":"2020-04-03","value":16},{"date":"2020-04-04","value":15},{"date":"2020-04-05","value":21},{"date":"2020-04-06","value":25},{"date":"2020-04-07","value":27},{"date":"2020-04-08","value":25},{"date":"2020-04-09","value":28},{"date":"2020-04-10","value":30},{"date":"2020-04-11","value":32},{"date":"2020-04-12","value":37},{"date":"2020-04-13","value":37},{"date":"2020-04-14","value":37},{"date":"2020-04-15","value":39},{"date":"2020-04-16","value":41}]},{"County":"Sălaj","Cases":[{"date":"2020-03-16","value":1},{"date":"2020-03-17","value":1},{"date":"2020-03-18","value":1},{"date":"2020-03-19","value":1},{"date":"2020-03-20","value":1},{"date":"2020-03-21","value":1},{"date":"2020-04-01","value":6},{"date":"2020-04-02","value":6},{"date":"2020-04-03","value":7},{"date":"2020-04-04","value":5},{"date":"2020-04-05","value":8},{"date":"2020-04-06","value":10},{"date":"2020-04-07","value":11},{"date":"2020-04-08","value":11},{"date":"2020-04-09","value":12},{"date":"2020-04-10","value":13},{"date":"2020-04-11","value":13},{"date":"2020-04-12","value":17},{"date":"2020-04-13","value":17},{"date":"2020-04-14","value":18},{"date":"2020-04-15","value":18},{"date":"2020-04-16","value":19}]},{"County":"Sibiu","Cases":[{"date":"2020-04-01","value":17},{"date":"2020-04-02","value":22},{"date":"2020-04-03","value":27},{"date":"2020-04-04","value":27},{"date":"2020-04-05","value":49},{"date":"2020-04-06","value":55},{"date":"2020-04-07","value":69},{"date":"2020-04-08","value":72},{"date":"2020-04-09","value":90},{"date":"2020-04-10","value":94},{"date":"2020-04-11","value":101},{"date":"2020-04-12","value":109},{"date":"2020-04-13","value":111},{"date":"2020-04-14","value":116},{"date":"2020-04-15","value":120},{"date":"2020-04-16","value":125}]},{"County":"Suceava","Cases":[{"date":"2020-03-04","value":1},{"date":"2020-03-05","value":1},{"date":"2020-03-06","value":1},{"date":"2020-03-07","value":1},{"date":"2020-03-08","value":1},{"date":"2020-03-09","value":1},{"date":"2020-03-10","value":1},{"date":"2020-03-11","value":1},{"date":"2020-03-12","value":1},{"date":"2020-03-13","value":1},{"date":"2020-03-14","value":1},{"date":"2020-03-15","value":1},{"date":"2020-03-16","value":2},{"date":"2020-03-17","value":4},{"date":"2020-03-18","value":5},{"date":"2020-03-19","value":9},{"date":"2020-03-20","value":9},{"date":"2020-03-21","value":16},{"date":"2020-03-31","value":638},{"date":"2020-04-01","value":665},{"date":"2020-04-02","value":701},{"date":"2020-04-03","value":866},{"date":"2020-04-04","value":967},{"date":"2020-04-05","value":1215},{"date":"2020-04-06","value":1228},{"date":"2020-04-07","value":1322},{"date":"2020-04-08","value":1430},{"date":"2020-04-09","value":1487},{"date":"2020-04-10","value":1529},{"date":"2020-04-11","value":1614},{"date":"2020-04-12","value":1661},{"date":"2020-04-13","value":1731},{"date":"2020-04-14","value":1733},{"date":"2020-04-15","value":1763},{"date":"2020-04-16","value":1910}]},{"County":"Teleorman","Cases":[{"date":"2020-03-15","value":1},{"date":"2020-03-16","value":2},{"date":"2020-03-17","value":2},{"date":"2020-03-18","value":2},{"date":"2020-03-19","value":2},{"date":"2020-03-20","value":2},{"date":"2020-03-21","value":2},{"date":"2020-04-01","value":15},{"date":"2020-04-02","value":16},{"date":"2020-04-03","value":24},{"date":"2020-04-04","value":21},{"date":"2020-04-05","value":21},{"date":"2020-04-06","value":30},{"date":"2020-04-07","value":31},{"date":"2020-04-08","value":36},{"date":"2020-04-09","value":41},{"date":"2020-04-10","value":56},{"date":"2020-04-11","value":59},{"date":"2020-04-12","value":62},{"date":"2020-04-13","value":65},{"date":"2020-04-14","value":70},{"date":"2020-04-15","value":74},{"date":"2020-04-16","value":76}]},{"County":"Timiș","Cases":[{"date":"2020-02-28","value":1},{"date":"2020-02-29","value":1},{"date":"2020-03-01","value":1},{"date":"2020-03-02","value":1},{"date":"2020-03-03","value":2},{"date":"2020-03-04","value":3},{"date":"2020-03-05","value":4},{"date":"2020-03-06","value":4},{"date":"2020-03-07","value":5},{"date":"2020-03-08","value":5},{"date":"2020-03-09","value":5},{"date":"2020-03-10","value":5},{"date":"2020-03-11","value":5},{"date":"2020-03-12","value":5},{"date":"2020-03-13","value":12},{"date":"2020-03-14","value":15},{"date":"2020-03-15","value":15},{"date":"2020-03-16","value":17},{"date":"2020-03-17","value":17},{"date":"2020-03-18","value":17},{"date":"2020-03-19","value":17},{"date":"2020-03-20","value":17},{"date":"2020-03-21","value":17},{"date":"2020-04-01","value":98},{"date":"2020-04-02","value":98},{"date":"2020-04-03","value":126},{"date":"2020-04-04","value":136},{"date":"2020-04-05","value":176},{"date":"2020-04-06","value":181},{"date":"2020-04-07","value":191},{"date":"2020-04-08","value":227},{"date":"2020-04-09","value":252},{"date":"2020-04-10","value":259},{"date":"2020-04-11","value":275},{"date":"2020-04-12","value":284},{"date":"2020-04-13","value":300},{"date":"2020-04-14","value":318},{"date":"2020-04-15","value":322},{"date":"2020-04-16","value":341}]},{"County":"Tulcea","Cases":[{"date":"2020-04-01","value":6},{"date":"2020-04-02","value":6},{"date":"2020-04-03","value":6},{"date":"2020-04-04","value":6},{"date":"2020-04-05","value":6},{"date":"2020-04-06","value":6},{"date":"2020-04-07","value":6},{"date":"2020-04-08","value":10},{"date":"2020-04-09","value":11},{"date":"2020-04-10","value":12},{"date":"2020-04-11","value":13},{"date":"2020-04-12","value":14},{"date":"2020-04-13","value":16},{"date":"2020-04-14","value":18},{"date":"2020-04-15","value":23},{"date":"2020-04-16","value":24}]},{"County":"Vaslui","Cases":[{"date":"2020-03-14","value":1},{"date":"2020-03-15","value":1},{"date":"2020-03-16","value":1},{"date":"2020-03-17","value":1},{"date":"2020-03-18","value":1},{"date":"2020-03-19","value":1},{"date":"2020-03-20","value":1},{"date":"2020-03-21","value":1},{"date":"2020-04-01","value":9},{"date":"2020-04-02","value":9},{"date":"2020-04-03","value":11},{"date":"2020-04-04","value":11},{"date":"2020-04-05","value":13},{"date":"2020-04-06","value":14},{"date":"2020-04-07","value":15},{"date":"2020-04-08","value":17},{"date":"2020-04-09","value":36},{"date":"2020-04-10","value":35},{"date":"2020-04-11","value":38},{"date":"2020-04-12","value":40},{"date":"2020-04-13","value":47},{"date":"2020-04-14","value":49},{"date":"2020-04-15","value":52},{"date":"2020-04-16","value":54}]},{"County":"Vâlcea","Cases":[{"date":"2020-03-16","value":2},{"date":"2020-03-17","value":2},{"date":"2020-03-18","value":2},{"date":"2020-03-19","value":2},{"date":"2020-03-20","value":2},{"date":"2020-03-21","value":3},{"date":"2020-04-01","value":7},{"date":"2020-04-02","value":7},{"date":"2020-04-03","value":8},{"date":"2020-04-04","value":9},{"date":"2020-04-05","value":8},{"date":"2020-04-06","value":8},{"date":"2020-04-07","value":9},{"date":"2020-04-08","value":9},{"date":"2020-04-09","value":11},{"date":"2020-04-10","value":11},{"date":"2020-04-11","value":13},{"date":"2020-04-12","value":13},{"date":"2020-04-13","value":13},{"date":"2020-04-14","value":15},{"date":"2020-04-15","value":15},{"date":"2020-04-16","value":15}]},{"County":"Vrancea","Cases":[{"date":"2020-03-11","value":1},{"date":"2020-03-12","value":1},{"date":"2020-03-13","value":1},{"date":"2020-03-14","value":1},{"date":"2020-03-15","value":1},{"date":"2020-03-16","value":1},{"date":"2020-03-17","value":2},{"date":"2020-03-18","value":2},{"date":"2020-03-19","value":2},{"date":"2020-03-20","value":2},{"date":"2020-03-21","value":2},{"date":"2020-04-01","value":60},{"date":"2020-04-02","value":60},{"date":"2020-04-03","value":70},{"date":"2020-04-04","value":70},{"date":"2020-04-05","value":79},{"date":"2020-04-06","value":79},{"date":"2020-04-07","value":79},{"date":"2020-04-08","value":90},{"date":"2020-04-09","value":95},{"date":"2020-04-10","value":95},{"date":"2020-04-11","value":116},{"date":"2020-04-12","value":117},{"date":"2020-04-13","value":134},{"date":"2020-04-14","value":157},{"date":"2020-04-15","value":160},{"date":"2020-04-16","value":174}]},{"County":"București","Cases":[{"date":"2020-03-07","value":1},{"date":"2020-03-08","value":2},{"date":"2020-03-09","value":3},{"date":"2020-03-10","value":12},{"date":"2020-03-11","value":20},{"date":"2020-03-12","value":21},{"date":"2020-03-13","value":31},{"date":"2020-03-14","value":35},{"date":"2020-03-15","value":39},{"date":"2020-03-16","value":44},{"date":"2020-03-17","value":70},{"date":"2020-03-18","value":89},{"date":"2020-03-19","value":92},{"date":"2020-03-20","value":97},{"date":"2020-03-21","value":110},{"date":"2020-04-01","value":492},{"date":"2020-04-02","value":505},{"date":"2020-04-03","value":544},{"date":"2020-04-04","value":550},{"date":"2020-04-05","value":552},{"date":"2020-04-06","value":566},{"date":"2020-04-07","value":598},{"date":"2020-04-08","value":637},{"date":"2020-04-09","value":659},{"date":"2020-04-10","value":688},{"date":"2020-04-11","value":730},{"date":"2020-04-12","value":751},{"date":"2020-04-13","value":774},{"date":"2020-04-14","value":789},{"date":"2020-04-15","value":824},{"date":"2020-04-16","value":866}]}]

  chartdata = {
    "Alba":[NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1,1,1,1,NaN,NaN,7,9,13,15,33,34,50,83,90,100,103,108,109,118,133,141,141,154,155],
    "Arad":[NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,4,8,8,8,8,8,8,NaN,NaN,110,110,110,128,150,157,161,161,162,179,229,249,270,280,312,339,360,391,402],
    "Argeș":[NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1,1,NaN,NaN,9,10,12,14,25,27,31,33,32,52,51,57,57,59,62,67,73,74,90],
    "Bacău":[NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1,1,1,1,1,1,1,2,2,NaN,NaN,19,19,24,27,38,39,47,51,56,58,65,69,76,76,81,94,107,102,105],
    "Bihor":[NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1,1,1,1,1,2,2,3,5,NaN,NaN,32,39,44,46,46,52,55,58,66,70,83,83,176,190,198,219,222,233,237],
    "Bistrița-Năsăud":[NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1,1,3,3,4,NaN,NaN,22,22,27,28,42,58,70,72,76,78,82,82,82,89,93,93,94,104,109],
    "Botoșani":[NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1,1,1,1,1,NaN,NaN,40,40,44,48,68,84,86,89,106,119,155,156,156,172,231,290,310,308,308],
    "Brașov":[NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2,4,7,7,12,15,15,16,25,NaN,NaN,105,117,124,127,131,138,156,161,175,190,219,238,253,263,270,286,299,308,315],
    "Brăila":[NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2,2,2,2,2,2,2,NaN,NaN,10,11,13,11,11,11,12,14,16,16,16,16,16,16,16,16,16,16,18],
    "Buzău":[NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1,1,1,1,1,1,1,2,2,2,2,2,2,NaN,NaN,11,12,12,12,12,13,13,13,13,13,13,13,13,14,14,14,14,15,15],
    "Caraș-Severin":[NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1,1,1,4,5,5,5,5,5,5,5,5,NaN,NaN,13,13,17,17,21,21,23,28,34,38,48,51,53,57,57,58,58,64,64],
    "Călărași":[NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1,1,NaN,NaN,17,17,26,29,30,31,33,35,34,35,35,35,39,39,41,41,40,40,40],
    "Cluj":[NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2,2,3,3,4,4,4,6,16,18,NaN,NaN,90,105,108,121,110,114,119,129,148,152,177,183,187,198,203,215,224,237,248],
    "Constanța":[NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1,1,5,9,10,11,12,14,15,21,25,NaN,NaN,111,111,117,110,114,117,119,114,124,124,155,157,151,158,163,168,172,181,183],
    "Covasna":[NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1,2,4,4,4,4,4,4,6,6,7,NaN,NaN,28,34,38,37,47,52,55,57,62,79,91,117,123,124,123,123,123,154,154],
    "Dâmbovița":[NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,17,19,19,27,23,24,25,27,28,30,30,30,31,31,31,31,73,73,82],
    "Dolj":[NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2,2,2,3,3,3,3,4,5,5,5,NaN,NaN,19,22,27,27,27,29,29,39,39,40,43,43,44,43,55,55,57,59,61],
    "Galați":[NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1,1,1,1,1,1,1,1,1,2,2,2,2,2,2,NaN,NaN,79,82,90,101,101,119,133,128,175,182,183,190,195,204,229,240,260,262,276],
    "Giurgiu":[NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2,NaN,NaN,19,19,22,23,24,32,34,36,46,46,47,49,64,74,75,80,83,91,98],
    "Gorj":[1,1,1,1,1,1,1,1,1,1,1,1,1,1,2,2,2,2,2,2,2,2,2,4,4,NaN,NaN,7,7,8,8,8,8,7,7,9,10,8,8,10,10,10,10,12,12,17],
    "Harghita":[NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1,1,1,3,3,3,4,5,6,7,7,7,7,9,11,16,16],
    "Hunedoara":[NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1,2,2,2,4,4,10,10,20,20,21,21,23,23,23,23,NaN,NaN,75,100,108,123,124,138,158,174,212,227,254,303,303,320,320,333,372,385,391],
    "Ialomița":[NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1,2,2,2,3,3,NaN,NaN,29,37,45,50,56,63,72,79,81,85,89,100,102,108,110,114,114,115,115],
    "Iași":[NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,3,3,5,5,6,6,13,20,21,21,24,NaN,NaN,52,54,72,81,88,87,92,106,131,99,107,113,118,119,121,130,149,154,156],
    "Ilfov":[NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,5,5,8,9,9,9,NaN,NaN,47,54,60,64,78,89,99,99,107,115,117,119,126,132,135,154,160,159,186],
    "Maramureș":[NaN,NaN,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,3,3,3,4,NaN,NaN,39,39,46,42,42,42,43,41,43,43,45,49,49,51,55,55,55,55,55],
    "Mehedinți":[NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2,2,2,2,2,2,2,2,2,NaN,NaN,9,10,11,13,12,13,13,13,15,16,17,17,19,22,22,28,35,35,37],
    "Mureș":[NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1,1,1,1,2,2,2,2,3,4,4,4,6,6,NaN,NaN,38,38,55,57,57,56,92,103,146,161,203,217,222,229,243,250,250,268,268],
    "Neamț":[NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1,2,2,2,3,5,5,5,6,14,NaN,NaN,94,107,150,148,160,160,182,196,202,234,265,285,286,304,344,348,350,357,364],
    "Olt":[NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1,1,1,1,1,2,2,2,2,2,2,2,3,3,3,3,NaN,NaN,8,8,8,11,11,11,11,12,12,11,11,12,12,13,13,13,13,13,13],
    "Prahova":[NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1,1,1,1,2,2,2,2,6,NaN,NaN,26,27,27,25,26,33,36,36,36,38,39,39,39,39,39,48,50,51,52],
    "Satu Mare":[NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1,1,1,1,1,1,1,1,NaN,NaN,13,16,16,15,21,25,27,25,28,30,32,37,37,37,39,41,42,44,45],
    "Sălaj":[NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1,1,1,1,1,1,NaN,NaN,6,6,7,5,8,10,11,11,12,13,13,17,17,18,18,19,19,20,20],
    "Sibiu":[NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,17,22,27,27,49,55,69,72,90,94,101,109,111,116,120,125,126,139,166],
    "Suceava":[NaN,NaN,NaN,NaN,NaN,NaN,NaN,1,1,1,1,1,1,1,1,1,1,1,1,2,4,5,9,9,16,NaN,638,665,701,866,967,1215,1228,1322,1430,1487,1529,1614,1661,1731,1733,1763,1910,1924,2019,2105],
    "Teleorman":[NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1,2,2,2,2,2,2,NaN,NaN,15,16,24,21,21,30,31,36,41,56,59,62,65,70,74,76,77,79,79],
    "Timiș":[NaN,NaN,1,1,1,1,2,3,4,4,5,5,5,5,5,5,12,15,15,17,17,17,17,17,17,NaN,NaN,98,98,126,136,176,181,191,227,252,259,275,284,300,318,322,341,354,361,376],
    "Tulcea":[NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,6,6,6,6,6,6,6,10,11,12,13,14,16,18,23,24,25,31,31],
    "Vaslui":[NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1,1,1,1,1,1,1,1,NaN,NaN,9,9,11,11,13,14,15,17,36,35,38,40,47,49,52,54,58,58,59],
    "Vâlcea":[NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2,2,2,2,2,3,NaN,NaN,7,7,8,9,8,8,9,9,11,11,13,13,13,15,15,15,17,18,19],
    "Vrancea":[NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1,1,1,1,1,1,2,2,2,2,2,NaN,NaN,60,60,70,70,79,79,79,90,95,95,116,117,134,157,160,174,186,186,215],
    "Mun. București":[NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1,2,3,12,20,21,31,35,39,44,70,89,92,97,110,NaN,NaN,492,505,544,550,552,566,598,637,659,688,730,751,774,789,824,866,942,977,1001]
    }
  colorz = ["#696969", "#556b2f", "#a0522d", "#006400", "#8b0000", "#808000", "#483d8b", "#bc8f8f", "#008080", "#4682b4", "#9acd32", "#00008b", "#daa520", "#8fbc8f", "#8b008b", "#ff4500", "#00ced1", "#ff8c00", "#0000cd", "#00ff00", "#00ff7f", "#dc143c", "#00bfff", "#f4a460", "#a020f0", "#adff2f", "#da70d6", "#ff00ff", "#1e90ff", "#db7093", "#f0e68c", "#fa8072", "#ffff54", "#dda0dd", "#b0e0e6", "#90ee90", "#ff1493", "#7b68ee", "#7fffd4", "#ffe4c4", "#ff0000","#000000"]

  constructor() { }

  ngOnInit(): void {}


    ngAfterContentInit() {
      this.initChart();
    }


  async initChart() {

    var config = {
      type: 'line',
			data: {
				labels: ["2020-02-26","2020-02-27","2020-02-28","2020-02-29","2020-03-01","2020-03-02","2020-03-03","2020-03-04","2020-03-05","2020-03-06","2020-03-07","2020-03-08","2020-03-09","2020-03-10","2020-03-11","2020-03-12","2020-03-13","2020-03-14","2020-03-15","2020-03-16","2020-03-17","2020-03-18","2020-03-19","2020-03-20","2020-03-21","2020-03-22","2020-03-31","2020-04-01","2020-04-02","2020-04-03","2020-04-04","2020-04-05","2020-04-06","2020-04-07","2020-04-08","2020-04-09","2020-04-10","2020-04-11","2020-04-12","2020-04-13","2020-04-14","2020-04-15","2020-04-16","2020-04-17","2020-04-18","2020-04-19"],
				datasets: []
			},
			options: {        
        responsive: false,
        layout: {
          padding: {
              left: 50,
              right: 0,
              top: 20,
              bottom: 20
          }
        },
        legend: {
          align: 'start',
          position: 'top',
          labels : {
            boxWidth: 20,
            padding: 20,            
            //usePointStyle: true,
          }
        },
				title: {
					display: true,
					text: 'Chart.js Line Chart - Cubic interpolation mode'
				},
				tooltips: {
					mode: 'nearest'
				},
				scales: {
					xAxes: [{
              type: 'time',
              distribution: 'linear'       
            }],
          yAxes: [{
              type: 'logarithmic',
              ticks: {
                callback: function(...args) {
                                    const value = ChartJS.Ticks.formatters.logarithmic.call(this, ...args);
                                    if (value.length) {
                                      return Number(value).toLocaleString()
                                    }
                                    return value;
                                  }
              }
            }]
        },
        annotation: {
          // Should be one of: afterDraw, afterDatasetsDraw, beforeDatasetsDraw
          // See http://www.chartjs.org/docs/#advanced-usage-creating-plugins
          drawTime: 'afterDatasetsDraw', // (default)      
          // Array of annotation configuration objects
          // See below for detailed descriptions of the annotation options
          annotations: [{
            drawTime: 'afterDraw', // overrides annotation.drawTime if set
            id: 'a-box-1',
            type: 'box',
            xScaleID: "x-axis-0",
            yScaleID: "y-axis-0",
            xMin: "2020-03-21",
            xMax: "2020-04-01",
            yMax: 0,
            yMin:  2000,
            borderColor: 'red',
            borderWidth: 0,
            backgroundColor: 'red',
          }]
        }
			},
      plugins: {
            pluginAnnotation
    }
    };
    debugger;
    
    let coloridx=0;
    for (let key in this.chartdata) {
      config.data.datasets.push({
        spanGaps: true,
        pointStyle: 'circle',
        label: key,
        borderColor: this.colorz[coloridx],
				backgroundColor: 'rgba(0, 0, 0, 0)',
				fill: false,
        data: this.chartdata[key], 
        lineTension: 0
      });
      coloridx++;
    }
    var ctx = (document.getElementById('canvasik') as HTMLCanvasElement).getContext('2d');
    
    var chart = new ChartJS.Chart(ctx, config);

    /*1
    var margin = {
      top: 20,
      right: 120,
      bottom: 30,
      left: 50
      },
      width = 960 - margin.left - margin.right,
      height = 500 - margin.top - margin.bottom;

    

    var parseDate = d3.timeParse("%Y-%m-%d"),
        bisectDate = d3.bisector(function(d:CountyDayData) { return d.date; }).left,
        formatValue = d3.format(","),
        dateFormatter = d3.timeFormat("%d/%m/%y");

    this.county_data.forEach((val,idx,arr)=>
        {
          arr[idx].Cases = val.Cases.map(q=> {return {"date":parseDate(q.date as string), "value": q.value};})
          arr[idx].color = this.colorz[idx];
        }
      );


    var x = d3.scaleTime().domain([d3.min(this.county_data,(d:CountyData)=>d3.min(d.Cases,(dd:CountyDayData)=>dd.date as Date)),
      d3.max(this.county_data,(d:CountyData)=>d3.max(d.Cases,(dd:CountyDayData)=>dd.date as Date))
    ]).range([0, width]);
    var y = d3.scaleLog().domain([d3.min(this.county_data,(d:CountyData)=>d3.min(d.Cases,(dd:CountyDayData)=>dd.value)),
      d3.max(this.county_data,(d:CountyData)=>d3.max(d.Cases,(dd:CountyDayData)=>dd.value))
    ]).range([height, 0]);

    var xAxis = d3.axisBottom(x)
        .tickFormat(dateFormatter);

    var yAxis = d3.axisLeft(y).ticks(3)
        .tickFormat(d3.format("d"));

    const line = d3.line<CountyDayData>().x(d => x(d.date as Date)).y(d => y(d.value));

    const chart = d3.select('svg').attr("width", width + margin.left + margin.right)
    .attr("height", height + margin.top + margin.bottom)
    .append('g')
    .attr('transform', "translate(" + margin.left + "," + margin.top + ")");
      
    //const tooltip = d3.select('#tooltip');
    //const tooltipLine = chart.append('line');
      
    // Add the axes and a title
    
    chart.append('g').call(yAxis); 
    chart.append('g').attr('transform', 'translate(0,' + height + ')').call(xAxis);
    chart.append('text').html('State Population Over Time').attr('x', 200);
    let states, tipBox;
    
      
    chart.selectAll().data(this.county_data).enter()
      .append('path')
      .attr('fill', 'none')
      .attr('stroke', d => d.color)
      .attr('stroke-width', 2)
      .datum(d => d.Cases)
      .attr('d', line);
    
    chart.selectAll()
      .data(this.county_data).enter()
      .append('text')
      .html(d => d.County)
      .attr('fill', d => d.color)
      .attr('alignment-baseline', 'middle')
      .attr('x', width)
      .attr('dx', '.5em')
      .attr('y', d => y(d3.max(d.Cases.map((q,idx,arr)=>q.value)))); 
    */
      /*
    tipBox = chart.append('rect')
      .attr('width', width)
      .attr('height', height)
      .attr('opacity', 0)
      .on('mousemove', drawTooltip)
      .on('mouseout', removeTooltip);
  })*/

  }

}
